# RoutingPreferenceRule Class

---
A class representing a rule set in MEP routing preferences.
SystemObject Autodesk.Revit.DBRoutingPreferenceRule
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RoutingPreferenceRule : IDisposable

    Public Class RoutingPreferenceRule
    	Implements IDisposable

    public ref class RoutingPreferenceRule : IDisposable

    type RoutingPreferenceRule =
        class
            interface IDisposable
        end
The RoutingPreferenceRule type exposes the following members.
| Name| Description
---|---|---
| RoutingPreferenceRule|  Constructs a RoutingPreferenceRule containing a segment or fitting Id (MEPPartId) and description.
Top
| Name| Description
---|---|---
| Description|  The description of the routing preference rule.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MEPPartId|  The referenced MEPPart (segment or fitting) type in this rule. It may be InvalidElementId if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
| NumberOfCriteria|  Gets the number of routing criteria.
| RoutingPreferenceManager|  Gets the routing preference manager that owns this rule.
Top
| Name| Description
---|---|---
| AddCriterion|  Adds a new routing criterion.
| Dispose| Releases all resources used by the RoutingPreferenceRule
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetCriterion|  Gets the specified criteria.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| RemoveCriteron|  Removes an existing criterion.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace